In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as pyplot

from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score
from Functions import *

In [5]:
df1=pd.read_csv("fe_binning.csv")

In [6]:
df1.head()

       country  happiness
0  Afghanistan   3.982855
1      Albania   4.606651
2    Argentina   6.697131
3      Armenia   4.348320
4    Australia   7.309061

In [16]:
#Allocate happiness to bins
binned=pd.cut(df1["happiness"], bins=[0,4,6,10], labels=["L","M","H"])

#Add the binned values aas a categorical feature
df1["happiness_band"]=binned

In [17]:
df1.head()

       country  happiness happiness_band
0  Afghanistan   3.982855              L
1      Albania   4.606651              M
2    Argentina   6.697131              H
3      Armenia   4.348320              M
4    Australia   7.309061              H

In [19]:
#Inspect the no of inviduals in each of the created classes
df1.groupby("happiness_band").size()

happiness_band
L    19
M    80
H    44
dtype: int64

In [20]:
##Categorical Binning
mapping=pd.read_csv("country_region.csv")

In [24]:

df1 = pd.merge(df1, mapping, left_on='country', right_on='country', how="left")

 df1.head()

In [25]:
df1.head()

,country,happiness,happiness_band,region_x,region_y
0,Afghanistan,3.982855,L,South Asia,South Asia
1,Albania,4.606651,M,Europe & Central Asia,Europe & Central Asia
2,Argentina,6.697131,H,Latin America & Caribbean,Latin America & Caribbean
3,Armenia,4.348320,M,Europe & Central Asia,Europe & Central Asia
4,Australia,7.309061,H,East Asia & Pacific,East Asia & Pacific

In [7]:
##Splitting
df2=pd.read_csv("fe_splitting.csv")

In [8]:
df2.head()

,borough,property_type,timestamp_of_call
0,Kensington And chelsea,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 16:48
1,Camden,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 22:20
2,Southwark,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 09:51
3,Westminster,Purpose Built Flats/Maisonettes - 4 to 9 storeys,01/01/2017 00:28
4,Barking And dagenham,House - single occupancy,01/01/2017 13:33

In [9]:
df2["timestamp_of_call"]=pd.to_datetime(df2["timestamp_of_call"])

In [10]:
df2.head()

,borough,property_type,timestamp_of_call
0,Kensington And chelsea,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 16:48:00
1,Camden,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 22:20:00
2,Southwark,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 09:51:00
3,Westminster,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 00:28:00
4,Barking And dagenham,House - single occupancy,2017-01-01 13:33:00

In [11]:
df2.dtypes

borough                      object
property_type                object
timestamp_of_call    datetime64[ns]
dtype: object

In [13]:
df2["day"]=df2["timestamp_of_call"].dt.day

In [14]:
df2["year"]=df2["timestamp_of_call"].dt.weekday

In [15]:
df2["month"]=df2["timestamp_of_call"].dt.month

In [16]:
df2["hour"]=df2["timestamp_of_call"].dt.hour

In [17]:
df2.head()

,borough,property_type,timestamp_of_call,day,year,month,hour
0,Kensington And chelsea,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 16:48:00,1,6,1,16
1,Camden,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 22:20:00,1,6,1,22
2,Southwark,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 09:51:00,1,6,1,9
3,Westminster,Purpose Built Flats/Maisonettes - 4 to 9 storeys,2017-01-01 00:28:00,1,6,1,0
4,Barking And dagenham,House - single occupancy,2017-01-01 13:33:00,1,6,1,13